{
  "backend/main.mo": "Motoko canister that validates a fixed gift code and tracks per-principal redemption status.",
  "feature_evidence.json": "Feature evidence report mapping UI/music-control requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles of all major frontend components, hooks, and config files.",
  "frontend/DEPLOYMENT_RETRY.md": "Guide explaining how to retry deployments, capture logs, and distinguish transient from code-related failures.",
  "frontend/index.css": "Root Tailwind/OKLCH theme variables and base styling for light/dark modes with Valentine color system.",
  "frontend/index.html": "Minimal HTML entrypoint with root mount node and script loading the React application.",
  "frontend/src/App.tsx": "Wraps the Valentine experience in BackgroundMusicProvider and renders MusicControlsPortal and Toaster.",
  "frontend/src/components/AmbientEffectsLayer.tsx": "Renders floating hearts and sparkles as decorative ambient background effects.",
  "frontend/src/components/AuthControls.tsx": "Internet Identity login/logout UI with signed‑in indicator and action buttons.",
  "frontend/src/components/GiftCodeStep.tsx": "Gift code input and redemption UI handling sign‑in requirement, validation, backend calls, and success state.",
  "frontend/src/components/MusicControls.tsx": "Music control panel with play/pause, track navigation, volume, and diagnostics when provider context is missing.",
  "frontend/src/components/MusicControlsPortal.tsx": "Creates and mounts a fixed portal container to render MusicControls above all content.",
  "frontend/src/components/ValentineCardView.tsx": "Displays an interactive Valentine card that reveals its message on click with themed animations and styles.",
  "frontend/src/components/ValentineStepControls.tsx": "Renders navigation buttons for a multi-step Valentine flow including start, next, back, and replay actions.",
  "frontend/src/content/valentineCards.ts": "Exports a list of ValentineCard objects containing titles, messages, and optional icons for display.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes related queries on change.",
  "frontend/src/hooks/useCardNavigationGestures.ts": "Adds keyboard and touch swipe gesture handlers for navigating between cards.",
  "frontend/src/hooks/useGiftCodeRedemption.ts": "Provides logic to check and redeem gift codes using the backend actor with UI feedback.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication, storing identity state and exposing login/clear utilities.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder exporting nothing for now.",
  "frontend/src/index.css": "Defines Tailwind base styles, Valentine-themed color variables, animations, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClientProvider, and InternetIdentityProvider.",
  "frontend/src/music/BackgroundMusicProvider.tsx": "Provides React context for background music playback with track loading, persistence, and error handling using an underlying HTMLAudioElement.",
  "frontend/src/music/playlist.ts": "Defines the Track interface and exports a static playlist of five audio tracks with file paths.",
  "frontend/src/pages/ValentineExperience.tsx": "Implements the multi-step Valentine experience flow with card navigation, gift code logic, gestures, and triggers background music playback.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Describes project state and known issue about missing music UI, including related existing feature requirements."
}